app/views/searches/search.html.erb

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
---
  </td>
  <td><%= "コメント数:#{book.book_comments.count}" %></td>