app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
       flash[:notice] = "You have created book successfully."
       redirect_to book_path(@book.id)
    else
       @user = current_user
       @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test5"], ["body", "あ"], ["user_id", 1], ["created_at", "2021-10-31 07:23:45.922697"], ["updated_at", "2021-10-31 07:23:45.922697"]]
SELECT "books".* FROM "books"

  def index
    @book = Book.new
    @user = current_user

    @books = Book.all
---
SELECT "books".* FROM "books"