app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "aass"], ["profile_image_id", "03229040c6c539b723df28037a9e7a8e5c93ae2cdb76084784893eb1b480"], ["updated_at", "2021-10-31 07:24:06.279597"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)